In [9]:
/*
1. Show the total population of the world.
*/

select sum(population) as Obyvatelia_Europy
from World
where continent = "Europe";

,Obyvatelia_Europy
0,610261850

In [14]:

select count(*), count(population), count(name), count(capital), count(gdp)
from World
-- where continent = "Europe";

,count(*),count(population),count(name),count(capital),count(gdp)
0,195,195,195,195,195

In [16]:

select sum(population), avg(population), max(population), min(population), count(population)
from World

,sum(population),avg(population),max(population),min(population),count(population)
0,7118632738,3.650581e+07,1365370000,839,195

In [20]:
/*
2. List of continents
List all the continents - just once each.
*/

/* select distinct continent 
from World
order by continent;
*/

select continent 
from World
group by continent;

,continent
0,Africa
1,Asia
2,Caribbean
3,Eurasia
4,Europe
5,North America
6,Oceania
7,South America

In [24]:
/*
3. GDP of Africa
Give the total GDP of Africa
*/

select sum(gdp) 'GDP Afriky'
from World
where continent = "Africa"

,GDP Afriky
0,8.176760e+11

In [25]:
/*
4. Count the big countries
How many countries have an area of at least 1000000
*/

select count(name)
from World
where area >= 1000000;

,count(name)
0,29

In [29]:
/*
5. Baltic states population
What is the total population of ('Estonia', 'Latvia', 'Lithuania')
*/

select sum(population)
from World
where name in ('Estonia', 'Latvia', 'Lithuania')

,sum(population)
0,7112380988

In [33]:
/* 
6.Counting the countries of each continent
For each continent show the continent and number of countries.
*/
select continent, count(name)
from World
group by continent
order by count(name) DESC

,continent,count(name)
0,Africa,53
1,Asia,47
2,Europe,44
3,Oceania,14
4,South America,13
5,North America,11
6,Caribbean,11
7,Eurasia,2

In [37]:
/*
7. Counting big countries in each continent
For each continent show the continent and number of countries with populations of at least 10 million.
*/

select continent, count(name)
from World
where population >= 10000000
group by continent
order by count(name) 
limit 3

,continent,count(name)
0,Eurasia,1
1,Oceania,1
2,Caribbean,2

In [45]:
SELECT continent, SUM(population)
  FROM World
  -- fuj where SUM(population)>500000000
 GROUP BY continent
 -- <> !=
HAVING SUM(population)<=500000000
order by SUM(population) DESC

,continent,SUM(population)
0,South America,407618970
1,Eurasia,149017400
2,Oceania,37783477
3,Caribbean,36149204